jmeter/test-result/4-jersey-microservice/statistics.json
{
  "SC0106002-DisputeNotation" : {
    "transaction" : "SC0106002-DisputeNotation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 530.2766666666666,
    "medianResTime" : 153.0,
    "minResTime" : 17.0,
    "maxResTime" : 2521.0,
    "pct1ResTime" : 1504.8000000000002,
    "pct2ResTime" : 1705.1499999999999,
    "pct3ResTime" : 2330.820000000001,
    "throughput" : 16.832183134152498,
    "receivedKBytesPerSec" : 3.9614806009089376,
    "sentKBytesPerSec" : 5.062805083319306
  },
  "SC0107001-FeePayment" : {
    "transaction" : "SC0107001-FeePayment",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3659.5433333333376,
    "medianResTime" : 3013.5,
    "minResTime" : 1615.0,
    "maxResTime" : 12547.0,
    "pct1ResTime" : 6132.400000000001,
    "pct2ResTime" : 7128.3499999999985,
    "pct3ResTime" : 9227.550000000007,
    "throughput" : 9.927857568336753,
    "receivedKBytesPerSec" : 2.3365367909855053,
    "sentKBytesPerSec" : 3.3642251720828646
  },
  "SC0104001-Transaction" : {
    "transaction" : "SC0104001-Transaction",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2908.4866666666667,
    "medianResTime" : 2278.0,
    "minResTime" : 908.0,
    "maxResTime" : 9331.0,
    "pct1ResTime" : 5516.400000000001,
    "pct2ResTime" : 6764.0,
    "pct3ResTime" : 8504.610000000002,
    "throughput" : 6.087538808059901,
    "receivedKBytesPerSec" : 1.4327117702562855,
    "sentKBytesPerSec" : 3.9176641352651123
  },
  "SC0103001-Activation" : {
    "transaction" : "SC0103001-Activation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1685.51,
    "medianResTime" : 1361.0,
    "minResTime" : 830.0,
    "maxResTime" : 8348.0,
    "pct1ResTime" : 3367.600000000001,
    "pct2ResTime" : 4135.9,
    "pct3ResTime" : 7828.630000000024,
    "throughput" : 5.465575980615424,
    "receivedKBytesPerSec" : 1.2863318470003096,
    "sentKBytesPerSec" : 1.6172553927016342
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2642.466190476189,
    "medianResTime" : 1672.0,
    "minResTime" : 17.0,
    "maxResTime" : 15826.0,
    "pct1ResTime" : 6070.5,
    "pct2ResTime" : 7968.799999999992,
    "pct3ResTime" : 13440.489999999967,
    "throughput" : 29.775830532987367,
    "receivedKBytesPerSec" : 4390.213256093411,
    "sentKBytesPerSec" : 13.828646741673401
  },
  "SC0102001-Review" : {
    "transaction" : "SC0102001-Review",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2165.136666666667,
    "medianResTime" : 1586.5,
    "minResTime" : 867.0,
    "maxResTime" : 9285.0,
    "pct1ResTime" : 4669.800000000001,
    "pct2ResTime" : 6023.15,
    "pct3ResTime" : 7596.140000000003,
    "throughput" : 5.255873438567599,
    "receivedKBytesPerSec" : 1.2369780260691323,
    "sentKBytesPerSec" : 1.8529006946512727
  },
  "SC0101001-Application" : {
    "transaction" : "SC0101001-Application",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3059.476666666666,
    "medianResTime" : 1738.0,
    "minResTime" : 860.0,
    "maxResTime" : 11057.0,
    "pct1ResTime" : 6698.600000000001,
    "pct2ResTime" : 7384.799999999999,
    "pct3ResTime" : 9709.130000000005,
    "throughput" : 5.111167901865576,
    "receivedKBytesPerSec" : 1.2029213519039101,
    "sentKBytesPerSec" : 5.2259695246613855
  },
  "SC0106001-TransactionQuery" : {
    "transaction" : "SC0106001-TransactionQuery",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4488.833333333338,
    "medianResTime" : 1133.0,
    "minResTime" : 105.0,
    "maxResTime" : 15826.0,
    "pct1ResTime" : 12957.7,
    "pct2ResTime" : 14234.949999999997,
    "pct3ResTime" : 15259.860000000002,
    "throughput" : 6.428387760349704,
    "receivedKBytesPerSec" : 6625.630785548984,
    "sentKBytesPerSec" : 1.9084276163538185
  }
}