jmeter/test-result/5-jersey-microservice-gateway/statistics.json
{
  "SC0106002-DisputeNotation" : {
    "transaction" : "SC0106002-DisputeNotation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7396.753333333329,
    "medianResTime" : 7379.5,
    "minResTime" : 37.0,
    "maxResTime" : 16104.0,
    "pct1ResTime" : 12075.400000000001,
    "pct2ResTime" : 13353.75,
    "pct3ResTime" : 14637.83,
    "throughput" : 7.227174174897615,
    "receivedKBytesPerSec" : 1.769528426885088,
    "sentKBytesPerSec" : 2.230260780534811
  },
  "SC0107001-FeePayment" : {
    "transaction" : "SC0107001-FeePayment",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7460.996666666667,
    "medianResTime" : 7256.5,
    "minResTime" : 1668.0,
    "maxResTime" : 15537.0,
    "pct1ResTime" : 10960.7,
    "pct2ResTime" : 12055.349999999995,
    "pct3ResTime" : 14826.960000000001,
    "throughput" : 7.437893588535727,
    "receivedKBytesPerSec" : 1.7505198777706152,
    "sentKBytesPerSec" : 2.6003573288044826
  },
  "SC0104001-Transaction" : {
    "transaction" : "SC0104001-Transaction",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7756.660000000006,
    "medianResTime" : 9707.5,
    "minResTime" : 24.0,
    "maxResTime" : 18788.0,
    "pct1ResTime" : 13870.300000000005,
    "pct2ResTime" : 14798.4,
    "pct3ResTime" : 18360.100000000006,
    "throughput" : 4.174610021847126,
    "receivedKBytesPerSec" : 0.9345446152748981,
    "sentKBytesPerSec" : 2.719203988839876
  },
  "SC0103001-Activation" : {
    "transaction" : "SC0103001-Activation",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3410.4833333333336,
    "medianResTime" : 1056.0,
    "minResTime" : 845.0,
    "maxResTime" : 14118.0,
    "pct1ResTime" : 11174.700000000006,
    "pct2ResTime" : 12093.4,
    "pct3ResTime" : 13492.710000000003,
    "throughput" : 5.12330077191065,
    "receivedKBytesPerSec" : 1.1906003974827517,
    "sentKBytesPerSec" : 1.5560024805314572
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5864.170000000001,
    "medianResTime" : 5535.0,
    "minResTime" : 8.0,
    "maxResTime" : 21268.0,
    "pct1ResTime" : 12214.800000000001,
    "pct2ResTime" : 13984.55,
    "pct3ResTime" : 16760.719999999994,
    "throughput" : 26.1568163417824,
    "receivedKBytesPerSec" : 612.5727632418883,
    "sentKBytesPerSec" : 12.363182724045588
  },
  "SC0102001-Review" : {
    "transaction" : "SC0102001-Review",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4362.023333333334,
    "medianResTime" : 1362.0,
    "minResTime" : 845.0,
    "maxResTime" : 21053.0,
    "pct1ResTime" : 13058.000000000002,
    "pct2ResTime" : 14735.349999999999,
    "pct3ResTime" : 18337.63,
    "throughput" : 4.613113544101366,
    "receivedKBytesPerSec" : 1.0727741486883382,
    "sentKBytesPerSec" : 1.6623426736068398
  },
  "SC0101001-Application" : {
    "transaction" : "SC0101001-Application",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3497.246666666664,
    "medianResTime" : 1183.5,
    "minResTime" : 844.0,
    "maxResTime" : 15293.0,
    "pct1ResTime" : 9722.7,
    "pct2ResTime" : 12013.25,
    "pct3ResTime" : 14478.160000000005,
    "throughput" : 4.41949882883281,
    "receivedKBytesPerSec" : 1.040135954832722,
    "sentKBytesPerSec" : 4.553292250408804
  },
  "SC0106001-TransactionQuery" : {
    "transaction" : "SC0106001-TransactionQuery",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7165.026666666669,
    "medianResTime" : 10021.0,
    "minResTime" : 8.0,
    "maxResTime" : 21268.0,
    "pct1ResTime" : 14653.7,
    "pct2ResTime" : 16271.499999999996,
    "pct3ResTime" : 19085.58,
    "throughput" : 4.408328802550953,
    "receivedKBytesPerSec" : 716.4871439815291,
    "sentKBytesPerSec" : 1.3431626820272435
  }
}